Revit 2027 API
STEPApplicationProtocol Enumeration
 An enumeration for STEP Application Protocols.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum STEPApplicationProtocol
Public Enumeration STEPApplicationProtocol
public enum class STEPApplicationProtocol
type STEPApplicationProtocol
Members
Member name | Value | Description
ApplicationProtocol203 | 0 |  Configuration Controlled Design Protocol 203.
ApplicationProtocol214 | 1 |  Automotive Design Protocol 214.
ApplicationProtocol242 | 2 |  Managed Model Based 3D Engineering, Includes Product Manufacturing Information Protocol 242.
See Also
Reference
Autodesk.Revit.DB Namespace